<!DOCTYPE html>
<html lang="pt-br">
{% load static %}
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Info Cripto</title>
    <script src="https://kit.fontawesome.com/99fbab6f1d.js" crossorigin="anonymous"></script>
    <link rel="stylesheet" type="text/css" href="{% static 'estilo.css'%}">
</head>

<body>
    <header>
        <div id="logo">
            <img
                src="{% static 'img/1434_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS91cGxvYWRzLzIwMjEtMDMvZGE0ZGNkNWEtMWQ3MS00YWM3LWE3OWYtZTdjNWFiYTczZmI0LmpwZw==.jpg'%}">
        </div>

        <ul>
            <a class="menu" href="../index" target="_blank"><li>Home</li></a>

            <a class="menu" href="../sobre" target="_blank"><li>Sobre</li></a>

            <a class="menu" href="../contato" target="_blank"><li>Contato</li></a>
        </ul>
    </header>

    <main>
        <h1> Blockchain da Ethereum</h1>
        <h2>Como funciona?</h2>
        <section class="texto">
            <p>Primeiro precisamos entender o conceito de blockchain,que nada mais &#xE9; que uma corrente de blocos
                interligados
                uns aos outros,fazendo com que para executar uma mudan&#xE7;a em um determinado bloco seja necess&#xE1;rio que
                voc&#xEA;
                altere tamb&#xE9;m os demais blocos,mas para isso voc&#xEA; precisa de uma grande participa&#xE7;&#xE3;o na reda da
                blockchain,
                seja em blockchains que usam algoritimos de consenso de prova de trabalho ou prova de travamento de
                tokens
                para vali&#xE7;&#xE3;o da rede.
            </p>
        </section>

        <section class="texto">
            <p>Na valida&#xE7;&#xE3;o da rede por meio da prova de trabalho, para conseguir fazer altera&#xE7;&#xF5;es nos blocos &#xE9;
                necess&#xE1;rio
                que voc&#xEA; tenha mais de 50% da for&#xE7;a computacional da rede,podendo variar esse percentual de acordo com a
                blockchain.
            </p>
        </section>
        <article>
         <img id=imagem1 src="{% static 'img/ethereum-cientistas.jpg'%}">
        </article>


        <section class="texto">
            <p>Na valida&#xE7;&#xE3;o da rede por meio de prova de travamento de tokens como &#xE9; o caso da blockchain da
                Ethereum,para conseguir fazer altera&#xE7;&#xF5;es nos blocos &#xE9; necess&#xE1;rio
                que voc&#xEA; tenha mais de dois ter&#xE7;os dos tokens travados na rede sendo um validador,ou seja voc&#xEA; precisa
                ter
                dois ter&#xE7;os dos nodes de valida&#xE7;&#xE3;o para conseguir alterar dados dentro da blockchain da Ethereum.
            </p>
        </section>

        <section class="texto">
            <p>Agora com uma no&#xE7;&#xE3;o de que blockchain &#xE9; na verdade um grande livro cont&#xE1;bil e de que as inform&#xE7;&#xF5;es
                adicinadas
                nesse grande computador descentralizado, e que tem sua seguran&#xE7;a mantida pelos pr&#xF3;prios &#xFA;suarios que
                mantem
                a
                rede segura seja disponibilizando for&#xE7;a computacional a rede ou aderindo ao stake travando seus tokens e
                se
                tornando nodes e portanto validadores da rede.
            </p>
        </section>
        <article>
         <img id=imagem src="{% static 'img/ethereum-como-funciona.png'%}">
        </article>

        <section class="texto">
            <p>Partindo agora para explicar a forma com que a blockchain da Ethereum funciona, como vimos antes existem
                de
                forma mais simplificada, dois tipos de se manter uma blockchain em opera&#xE7;&#xE3;o e em seguran&#xE7;a,que &#xE9; por
                meio de
                uma
                rede de computadores que rodam c&#xF3;pias da blockchain com software expec&#xED;ficos que trasmitem informa&#xE7;&#xF5;es
                entre
                s&#xED; mantendo-se sempre atualizados com as informa&#xE7;&#xF5;es mais recentes adicionadas a blockchain e tudo isso
                de
                forma descentralizada e por pessoas que participam da rede de forma espont&#xE2;nea pois veem valor em aderir
                a
                novas tecnologias e tamb&#xE9;m veem valor no fato da blockchain da Ethereum disponibilizar um ecossistema
                novo e
                totalmente diferente de qualquer coisa que vimos antes; que s&#xE3;o os contratos inteligentes que permitem
                que
                sejam criados aplica&#xE7;&#xF5;es dentro da blockchain da Ethereum de forma an&#xF4;nima e descentralizada.
            </p>
        </section>
        <article>
            <img id=imagem2 src="{% static 'img/ethereum-piramide.png'%}">
        </article>
        <section class="texto">
            <p>Os contratos inteligentes s&#xE3;o literalmente linhas de c&#xF3;digo que podem ser adicionadas a blochain da
                Ethereum,
                para prover aplica&#xE7;&#xF5;es demandadas por usu&#xE1;rios da rede,seja uma forma de criar ferramentas para cria&#xE7;&#xE3;o
                de
                tokens n&#xE3;o fung&#xED;veis que s&#xE1;o uma nova forma de garantir a posse e a veracidade de alguma informa&#xE7;&#xE3;o, j&#xE1;
                que
                um token n&#xE3;o fung&#xED;vel n&#xE3;o pode ser copiado ou falsificado pois possue caracter&#xED;sticas que fazem dele
                &#xFA;nico,
                e os tokens n&#xE3;o fung&#xED;veis podem ser a nova forma de garantir informa&#xE7;&#xF5;es de posse por exemplo de ativos
                financeiros; Os contratos inteligentes tamb&#xE9;m s&#xE3;o usados para cria&#xE7;&#xE3;o de aplica&#xE7;&#xF5;es financeiras
                descentralizadas como &#xE9; o caso da Uniswap que &#xE9; nos dias atuais a maior aplica&#xE7;&#xE3;o financeira
                descentralizada
                da rede ethereum, e o servi&#xE7;o prestado pela uniswap a seus usu&#xE1;rios &#xE9; de forma geral o mesmo servi&#xE7;o
                ofercido por uma corretora,por&#xE9;m com a diferen&#xE7;a de que voc&#xEA; n&#xE3;o precisa passar por toda burocracia de
                entrega de documentos, dados pessoais e demontra&#xE7;&#xF5;es financeiras, e mesmo assim podendo ter o pedido de
                abertura de conta negado,j&#xE1; na uniswap voc&#xEA; n&#xE3;o passa por nada disso e tamb&#xE9;m n&#xE3;o &#xE9; barrado de utilizar
                a
                aplica&#xE7;&#xE3;o financeira oferecida pela uniswap.
            </p>
        </section>

        <section class="texto">
            <p>
                Podemos falar de forma simploria e resumida que a blockchain da ethereum &#xE9; um grande computador
                descentralizado, que funciona por meio de softwares rodados em m&#xE1;quinas ao redor do globo que mantem
                todas
                as
                informa&#xE7;&#xF5;es desse grande livro cont&#xE1;bil sempre em sincronia, e que todas as informa&#xE7;&#xF5;es adicionadas na
                blockchain s&#xE3;o verificadas pelos milhares de nodes que garantem a veracidade das informa&#xE7;&#xF5;es adicionadas
                na
                rede,
                nodes esses que travam tokens Ether que s&#xE3;o a moeda circulante de todo esse ecossitema e que faz o papel
                de
                tamb&#xE9;m ser o instrumento de seguran&#xE7;a da rede, pois por meio do travamento desses tokens &#xE9; que novos
                nodes
                de
                valida&#xE7;&#xE3;o s&#xE3;o criados, adicionando assim mais seguran&#xE7;a para rede e mantendo todo o bom funcionamento
                desse
                ecossistem descentralizado.
            </p>
        </section>

        <section class="formulario">
            <h2>
                J&#xE1; pensou em receber informa&#xE7;&#xF5;es sobre o Mundo Cripto todos os dias?
            </h2>
            <h3>
                Se inscreva na nossa Newslatter!!
            </h3>
            <form>

                <input type="text" placeholder="Nome" />
                <input type="email" placeholder="E-mail" />
                <input type="submit" value="Enviar>">


            </form>
        </section>
    </main>

    <footer>

        <p>Copyright 2022 - Info Cripto</p>
        <p>Site desenvolvido na aula de programa&#xE7;&#xE3;o do PDA.</p>
        <a id ="rodape" href="https://programadoresdoamanha.org/" target="_blank"><li>Site PDA</li></a>

    </footer>



</body>

</html>